# ClipPlane Constructor (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ClipPlane Constructor
ClipPlane Class See Also
---
Constructs a copy of the clip plane.
**Namespace:** Autodesk.Revit.DB.DirectContext3D**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public ClipPlane(
	ClipPlane other
)
```

Visual Basic
---
```text
Public Sub New ( _
	other As ClipPlane _
)
```

Visual C++
---
```text
public:
ClipPlane(
	ClipPlane^ other
)
```

# ### Parameters
other
    Type: Autodesk.Revit.DB.DirectContext3D..::..ClipPlane
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
ClipPlane Class
Autodesk.Revit.DB.DirectContext3D Namespace